CSI API ETABS v1

# cDetailingGetNumberDetailedWallStacks Method

---

Retrieves number of Detailed outputs for Wall

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetNumberDetailedWallStacks(
    	ref int NumberWallStacks
    )

    Function GetNumberDetailedWallStacks (
    	ByRef NumberWallStacks As Integer
    ) As Integer

    Dim instance As cDetailing
    Dim NumberWallStacks As Integer
    Dim returnValue As Integer

    returnValue = instance.GetNumberDetailedWallStacks(NumberWallStacks)

    int GetNumberDetailedWallStacks(
    	int% NumberWallStacks
    )

    abstract GetNumberDetailedWallStacks :
            NumberWallStacks : int byref -> int

#### Parameters

NumberWallStacks

    Type: SystemInt32
Number of wall stacks in model.

#### Return Value

Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero
value.

See Also

#### Reference

cDetailing Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com